# Напишите функцию, которая отображает на экран
# форматированный текст, указанный ниже:
# “Don't compare yourself with anyone in this world…
# if you do so, you are insulting yourself.”
# Bill Gates 
def text ():
    print('“Don\'t compare yourself with anyone in this world…\n if you do so, you are insulting yourself.”\n\t\t\t\tBill Gates')
text()