# Напишите функцию, которая считает количество
# цифр в числе. Число передаётся в качестве параметра. Из
# функции нужно вернуть полученное количество цифр.
# Например, если передали 3456, количество цифр будет 4.n = -100.90

n= int(input("Внесіть число: "))
n1= int(input("Внесіть число: "))

digits = len(str(n))
digits1 = len(str(n1))
print(digits)
print(digits1)