# Вывести на экран фигуры, заполненные звездочками.
# Диалог с пользователем реализовать при помощи меню.
# B.

for i in range(n):
 print(" "*i,(n-2*i)*"*" ," "*i, sep='')
