# Напишите функцию, удаляющую из списка целых
# некоторое заданное число. Из функции нужно вернуть
# количество удаленных элементов.

List = input("Введіть цілі числа через пробел: ")

List = List.split()

def delete_number(List):
    for 
        
print()

