# Напишите функцию, определяющую количество простых чисел в списке целых. Список передаётся в качестве
# параметра. Полученный результат возвращается из функции.


def count_is_prime(mas):
    count = 0
    for i in list1:
        if count_is_prime(i):
            count+=1
    return count
list1 = [54,765,34,423,654,86,643]
print(count_is_prime(list1))
