# Пользователь вводит с клавиатуры строку. Произведите поворот строк и полученный результат выведите
#  на экран.

line= 'Введіть правильно рядок'
print(line [ : : -1])