# Пользователь вводит с клавиатуры строку и символ
# для поиска. Посчитайте сколько раз в строке встречается
# искомый символ. Полученное число выведите на экран.

line= 'Beautifully'
count= line.count ('l')
count1= line.count ('u')
print(count, count1)