# Есть некоторый текст. Реализуйте следующую функциональность:
# ■ Изменить текст таким образом, чтобы каждое предложение начиналось с большой буквы;
# ■ Посчитайте сколько раз цифры встречаются в тексте;
# ■ Посчитайте сколько раз знаки препинания встречаются в тексте;
# ■ Посчитайте количество восклицательных знаков в
 # тексте.
# count=0
# lst= [багато інформації, що обробляється 34 програмами, перебуває у текстовому вигляді. текст 8 сприймається людиною
# легко. для програміста важливо конкретно і чітко розуміти,як 6 такі дані зберігаються!]
    


    
